queueOS-backend/tests/artillery-stress.yml

config:
  target: 'http://localhost:5000'
  phases:
    - duration: 5
      arrivalRate: 50
      name: "Phase 1: Warm up (50 users/sec)"
    - duration: 10
      arrivalRate: 200
      name: "Phase 2: Heavy Load (200 users/sec)"
    - duration: 10
      arrivalRate: 1000
      name: "Phase 3: Breaking Point (1,000 users/sec)"
  http:
    timeout: 5
scenarios:
  - name: "Mixed Traffic Simulation"
    flow:
      - get:
          url: "/api/queue/current/6a3bb17f9882446c5f83c75e/6a3bb9060d076e19df960120"
      - post:
          url: "/api/queue/predict-wait-time"
          json:
            businessCategory: "hospital"
            serviceType: "consultation"
            queueLength: 5
            hourOfDay: 14
            dayOfWeek: 2
            avgServiceDuration: 15
            staffCount: 2